Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Consequently, the GlobalWindows assigner requires a custom trigger and possibly an evictor to selectively
zh_cn: 因此，GlobalWindows分配器需要一个自定义的触发器，可能还需要一个移除器来有选择地将元素从窗口状态中删除。

source: Consequently, the number of key groups of a stateful operator determines its maximum parallelism.
zh_cn: 因此状态化算子键值组的数量决定了其最大并行度。

source: Consequently, the processing latencies and state size of time-based opera‐ tors can significantly increase if a task does not receive new watermarks from all input tasks at regular intervals.
zh_cn: 因此，如果一个任务没有从全部输入任务以常规间隔接收新的水位线，就会导致时间相关算子的处理延迟或状态大小激增。

source: Consequently, these functions should only be used if the key values are from a constant and bounded domain.
zh_cn: 所以说，只有在键值域不变或有界的前提下才能使用这些函数。

source: Consequently, today’s data infrastructures often consist of many different storage systems.
zh_cn: 因此，如今的数据基础设施通常都由很多不同的存储系统组成。

source: Consequently, you should either ensure the value of the broadcast state does not depend on the order in which the broadcasted mes‐ sages are received or ensure the parallelism of the broadcasting operator is set to 1.
zh_cn: 因此你需要确保广播状态的值不依赖于收到广播消息的顺序，或者将上游广播算子的并行度设置为1.

source: Conse‐ quently, GlobalWindows will never be completely cleaned up.
zh_cn: 因此，它永远不会被彻底清除。

source: Conse‐ quently, an application can only be operated under exactly-once state consistency if all input streams are consumed by resettable data sources.
zh_cn: 因此只有所有输入流都是来自于可重置的数据源，应用才支持精确一次的状态一致性。

source: Conse‐ quently, there is no window without at least one element.
zh_cn: 因此，每个窗口至少会有一个元素。

source: Consid‐ ering that streaming applications might run for several days, months, or even years, you need to make sure that state can be reliably recovered under failures and that your system can guarantee accurate results even if things break.
zh_cn: 考虑到流式应用可能需要成日、甚至长年累月地运行，因此必须保证出错时状态能进行可靠的恢复，即使发生故障系统也能提供准确的结果。

source: Consider Bob, another player of the online mobile game, who happens to be on the same train as Alice.
zh_cn: 假设有另一位名叫鲍勃的玩家也在玩那个在线手游，他恰好和爱丽丝在同一趟地铁上。

source: Consider a program that analyzes events generated by users playing an online mobile game.
zh_cn: 假设有某个应用程序会分析用户玩在线手游时产生的事件。

source: Consider a program that analyzes events generated by users playing online mobile games.
zh_cn: 考虑某程序会分析用户玩在线手游时产生的事件，

source: Consider an application that ana‐ lyzes online user behavior.
zh_cn: 假设有一个应用要在线分析用户行为，

source: Consider an application that analyzes online user behavior.
zh_cn: 假设有一个应用要在线分析用户行为，

source: Consider an application that monitors a forest area and outputs an alert when‐ ever there is a high risk of fire.
zh_cn: 假设有一个森林区域监控应用会在火灾发生风险很高时报警。

source: Consider an application that provides real-time traffic information to drivers so that they can avoid congested routes.
zh_cn: 假设有一个应用能向司机提供实时路况信息以帮助他们躲避拥堵。

source: Consider for example a streaming join opera‐ tion or a holistic aggregate, such as median.
zh_cn: 例如：流连接或是像求中位数的整体聚合。

source: Consider the case where Alice starts popping bubbles while her phone is connected to the network and sends events to the analysis application.
zh_cn: 因此考虑如下情况：爱丽丝开始消泡泡的时候手机还能联网向分析应用发送事件，

source: Consider the case where Alice starts pop‐ ping bubbles while her phone is connected to the network and sends events to the analysis application.
zh_cn: 因此考虑如下情况：爱丽丝开始消泡泡的时候手机还能联网向分析应用发送事件。

source: Consider the following case classes:
zh_cn: 考虑以下样例类：

source: Consider the following example of keying a stream of Tuple3[Int, Int, Int] on the first field and computing a rolling sum on the second field:
zh_cn: 以下例子中，我们对一个Tuple3[Int, Int, Int]类型的数据流按照第一个字段进行键值分区，然后滚动计算第二个字段的总和：

source: Consider, for example, a streaming join opera‐ tion or a holistic aggregate, such as the median function.
zh_cn: 例如：流式Join或者像是求中位数的整体聚合（holistic aggregate）。

source: Considering that streaming applications might run for several days, months, or even years, you need to make sure that state can be reliably recovered under failures and that your system can guarantee accurate results even if things break.
zh_cn: 考虑到流式应用可能需要整日、甚至长年累月地运行，因此必须保证出错时其状态能进行可靠的恢复，并且即使系统发生故障系统也能提供准确的结果。

source: Considering the color of the input event as the key, Figure 5-4 assigns black events to one partition and all other events to another partition.
zh_cn: 我们假设以输入事件的颜色作为键值，图5-4中将所有黑色事件分到一个任务，而将其他事件分到另一个任务。

source: Considering window operators complicate latency tracking even further, if an event contributes to several windows, do we need to report the latency of the first invocation or do we need to wait until we evaluate all windows an event might belong to?
zh_cn: 而窗口算子会使延迟追踪变得更加复杂。如果事件被同时分配到多个窗口，那么我们应该以第一次窗口调用时的延迟为准还是等它所有参与的窗口都计算完后再来测量？

source: Consistent Checkpoints
zh_cn: 一致性检查点

source: Consult the Flink documentation for a full list of configuration options per supported reporter.
zh_cn: 要获得每个所支持汇报器的完整配置选项，请参阅Flink文档。

source: Consult the Flink documentation for detailed instructions on enabling and configuring Kerberos authentication.
zh_cn: 有关启用和配置Kerberos身份验证的详细说明，请参阅Flink文档。

source: Consult the Kafka documentation for additional configuration properties.
zh_cn: 其他配置属性请参照Kafka文档。

source: Consult “State Management” on page 53 for more details on keyed state.
zh_cn: 有关键值分区状态的详细信息请参照第53页"状态管理"一节。

source: Consumers of the log incorporate the updates into the affected data stores.
zh_cn: 日志的消费方会将这些更新整合到相关数据存储系统中。

source: Controlling Task Chaining
zh_cn: 控制任务链接

source: Controlling Task Scheduling
zh_cn: 控制任务调度

source: Controlling Task Scheduling | 261
zh_cn: 控制任务调度 | 261

source: Controlling task scheduling with slot-sharing groups
zh_cn: 通过处理槽共享组控制任务调度

source: Con‐ sider a scenario where you detect a bug in your deployed application.
zh_cn: 考虑这样一种场景——你在已部署的应用中发现一个Bug。

source: Count-Based Windows
zh_cn: 基于数量的窗口

source: Count-based tumbling window
zh_cn: 基于数量的滚动窗口

source: Count-based tumbling window.
zh_cn: 基于数量的滚动窗口。

source: Count-based tumbling windows define how many events are collected before triggering evaluation.
zh_cn: 基于数量的（count-based）滚动窗口定义了在触发计算前需要集齐多少条事件。

source: Create a Cassandra sink for POJOs
zh_cn: 为POJO类型创建Cassandra数据汇

source: Creating Type Information for Data Types
zh_cn: 为数据类型创建类型信息

source: Creating TypeInformation for data types
zh_cn: 为数据类型创建TypeInformation

source: Creating a Cassandra sink for tuples
zh_cn: 创建一个针对元组的Cassandra数据汇

source: Creating a Flink Kafka sink
zh_cn: 创建一个Flink Kafka数据汇

source: Creating a Flink Kafka source
zh_cn: 创建Flink kafka数据源连接器

source: Creating a StreamingFileSink in bulk-encoding mode
zh_cn: 创建块编码模式的StreamingFileSink

source: Creating a StreamingFileSink in row-encoding mode
zh_cn: 以行编码方式创建一个StreamingFileSink

source: Creating a filesystem source
zh_cn: 创建文件系统数据源

source: Credit-Based Flow Control
zh_cn: 基于信用值的流量控制

source: Credit-based Flow Control
zh_cn: 基于信用度的流量控制

source: Credit-based flow control reduces latency because senders can ship data as soon as the receiver has enough resources to accept it.
zh_cn: 由于发送端可以在接收端有足够资源时立即传输数据，所以基于信用值的流量控制可以有效降低延迟。

source: Credit-based flow control reduces the latency because senders can ship data as soon as the receiver has enough resources to accept it.
zh_cn: 由于发送端可以在接收端有足够资源时立即传输数据，因此基于信用度的流量控制可以降低延迟。

source: Currently, Flink offers three state backends, the MemoryStateBackend, the FsState Backend, and the RocksDBStateBackend:
zh_cn: 目前，Flink提供了三种状态后端：MemoryStateBackend，FsStateBackend以及RocksDBStateBackend：

source: Currently, Flink provides eight different process functions: ProcessFunction, Keyed ProcessFunction, CoProcessFunction, ProcessJoinFunction, BroadcastProcess Function, KeyedBroadcastProcessFunction, ProcessWindowFunction, and ProcessAllWindowFunction.
zh_cn: 目前，Flink提供了8种不同的处理函数：ProcessFunction、KeyedProcessFunction、CoProcessFunction、ProcessJoinFunction、BroadcastProcessFunction、KeyedBroadcastProcessFunction、ProcessWindowFunction以及ProcessAllWindowFunction。

source: Currently, the two APIs use separate execution environments and cannot be mixed.
zh_cn: 目前，这两类API都有各自独立的执行环境，还无法混合使用。

source: Custom
zh_cn: 自定

source: Custom Configuration in Flink Images
zh_cn: 在Flink镜像中自定义配置

source: Custom Partitioning and Writing Message Timestamps
zh_cn: 自定义分区和写入消息时间戳

source: Custom window operators are discussed in detail later in this section.
zh_cn: 详细内容会在本节稍后讨论。

source: Custom-defined state in a trigger
zh_cn: 触发器中的自定义状态

source: Custom-defined trigger state and registered trigger timers are not cleared because this state is opaque to the window operator.
zh_cn: 自定义触发器状态和触发器中注册的计时器将不会被清除，因为这些状态对于窗口算子而言是不可见的。

source: Customizing Window Operators
zh_cn: 自定义窗口算子

source: DELETE_ON_CANCELLATION retains the checkpoint only after the application com‐ pletely fails.
zh_cn: DELETE_ON_CANCELLATION只有在应用完全失败后才会保留检查点。

source: Data ingestion is the operation of fetching raw data from exter‐ nal sources and converting it into a format that is suitable for processing.
zh_cn: 数据接入操作从外部数据源获取原始数据并将其转换成适合后续处理的格式。

source: Data egress is the operation of producing output in a form that is suitable for consumption by external systems.
zh_cn: 数据输出操作将数据以适合外部系统使用的格式输出。

source: Data Exchange Strategies
zh_cn: 数据交换策略

source: Data Parallelism and Task Parallelism
zh_cn: 数据并行和任务并行

source: Data Pipelines
zh_cn: 数据管道

source: Data Pipelines and Real-time ETL
zh_cn: 数据管道和实时ETL

source: Data Transfer between TaskManagers.
zh_cn: TaskManager之间的数据传输。

source: Data Transfer in Flink
zh_cn: Flink中的数据传输

source: Data Transfer in Flink | 45
zh_cn: Flink中的数据传输 | 45

source: Data and data processing have been omnipresent in businesses for many decades.
zh_cn: 几十年来，数据和数据处理在各类商业领域中无处不在。

source: Data arriving to the Lambda architecture is ingested by the stream processor as well as written to a batch storage such as HDFS.
zh_cn: 该架构中到来的数据会同时发往流处理引擎和写入批量存储（如：HDFS）。

source: Data arriv‐ ing at the lambda architecture is ingested by the stream processor and also written to
zh_cn: 在该架构中，到来的数据会同时发往流处理引擎和写入批量存储。

source: Data can be stored in many different systems, such as filesystems, object stores, rela‐ tional database systems, key-value stores, search indexes, event logs, message queues, and so on.
zh_cn: 我们日常可以把数据存储在很多不同的系统中，例如：文件系统，对象存储，关系数据库系统，键值存储，搜索索引，事件日志以及消息队列等。

source: Data egress is the operation of producing output in a form suitable for consumption by external sys‐ tems.
zh_cn: 数据输出操作是将数据以适合外部系统使用的格式输出。

source: Data exchange strategies
zh_cn: 数据交换策略

source: Data exchange strategies can be automatically chosen by the execu‐ tion engine depending on the semantics of the operators or explicitly imposed by the dataflow programmer.
zh_cn: 这些策略可以由执行引擎根据算子的语义自动选择，也可以由dataflow编码人员显式指定。

source: Data exchange strategies define how data items are assigned to tasks in a physical dataflow graph.
zh_cn: 数据交换策略定义了如何将数据项分配给物理Dataflow图中的不同任务。

source: Data exchange strategies.
zh_cn: 数据交换策略。

source: Data ingestion and data egress
zh_cn: 数据接入和数据输出

source: Data ingestion and data egress operations allow the stream processor to communicate with external systems.
zh_cn: 数据接入和数据输出操作允许流处理引擎和外部系统进行通信。

source: Data ingestion is the operation of fetching raw data from exter‐ nal sources and converting it into a format suitable for processing.
zh_cn: 数据接入操作是从外部数据源获取原始数据并将其转换成适合后续处理的格式。

source: Data parallelism and task parallelism
zh_cn: 数据并发度和任务并发度

source: Data parallelism is use‐ ful because it allows for processing large volumes of data and spreading the computa‐ tion load across several computing nodes.
zh_cn: 数据并行非常有用，因为它支持处理大规模数据，能够将计算负载分配到多个节点上。

source: Data pipelines must be able to process large amounts of data in a short time.
zh_cn: 它需要在短时间内处理大批量数据。

source: Data processing frameworks are sensitive components of a company’s IT infrastruc‐ ture and need to be secured against unauthorized use and access to data.
zh_cn: 数据处理框架属于公司IT基础架构中的敏感组件，我们需要对其采取某些保护措施，以防出现未经授权的使用或数据访问。

source: Data stream processing is not a novel technology.
zh_cn: 数据流处理并非是一项新技术，

source: Data that resides in such storage systems can be queried with and processed by a SQL-on-Hadoop engine, for example Apache Hive, Apache Drill, or Apache Impala.
zh_cn: 而它们中的数据也可以通过很多基于Hadoop的SQL引擎（如Apache Hive、Apache Drill或Apache Impala）进行查询和处理。

source: Data that resides in such storage systems is accessible to several SQL-on-Hadoop engines, as for example Apache Hive, Apache Drill, or Apache Impala.
zh_cn: 而它们中的数据也可以通过很多基于Hadoop的SQL引擎（如：Apache Hive、Apache Drill、Apache Impala）进行访问。

source: Data transfer between TaskManagers
zh_cn: TaskManager之间的数据传输

source: DataSet programs are speci‐ fied as a series of transformations just like DataStream programs with the difference that a DataSet is a bounded data collection.
zh_cn: DataSet程序和DataStream程序一样，都是由一系列转换操作组成；但二者的不同在于DataSet是一个有界的数据集。

source: DataStream<Tuple3<Integer, String, Long>> javaInput = ... javaInput.keyBy("f2") // key Java tuple by 3rd field
zh_cn: DataStream<Tuple3<Integer, String, Long>> javaInput = ... javaInput.keyBy("f2") // Java元组以第3个字段为键值

source: Dataflow Graphs
zh_cn: Dataflow图

source: Dataflow graphs
zh_cn: Dataflow图

source: Dataflow graphs like the one in Figure 2-1 are called logical because they convey a high-level view of the computation logic.
zh_cn: 类似图2-1的Dataflow图被称作逻辑图，因为它们表达了高层视角下的计算逻辑。

source: Dataflow graphs like the one of Figure 2-1 are called logical because they convey a high-level view of the computation logic.
zh_cn: 诸如图2-1之类的dataflow图被称作逻辑图，因为它们描述了高层视角下的计算逻辑。

source: Dataflow programs are commonly represented as directed graphs, where nodes are called operators and represent computations and edges represent data dependen‐ cies.
zh_cn: dataflow程序通常会表示为有向图。其中节点称为算子（operator），表示计算；而边表示数据间的依赖关系。

source: Debug Flink Applications in an IDE
zh_cn: 在IDE中调试Flink程序

source: Debug Flink applications in an IDE
zh_cn: 在IDE中调试Flink程序

source: Declaring Keyed State at RuntimeContext
zh_cn: 在RuntimeContext中声明键值分区状态

source: Declaring Keyed State at the RuntimeContext
zh_cn: 在RuntimeContext中声明Keyed State

source: Decreasing or increasing the parallelism of an application is not difficult.
zh_cn: 减少或增加应用的并行度并不困难。

source: Default value
zh_cn: 默认值

source: Default value is 2, i.e., an application is restarted at most once.
zh_cn: 默认值是2，即应用最多重启一次。

source: Defining Keys and Referencing Fields
zh_cn: 定义键值和引用字段

source: Defining Keys and Referencing Fields | 103
zh_cn: 定义键值和引用字段 | 103

source: Defining Slot Sharing Groups
zh_cn: 定义Slot共享组

source: Defining Slot-Sharing Groups
zh_cn: 定义处理槽共享组

source: Defining Window Operators
zh_cn: 定义窗口算子

source: Defining a Cassandra example table
zh_cn: 定义Cassandra示例表

source: Defining a window operator with a side output for late events
zh_cn: 在窗口算子中为迟到事件定义副输出

source: Defining a window operator with an allowed lateness of 5 seconds
zh_cn: 定义延迟容忍度为5秒的窗口算子

source: Defining keys and referencing fields
zh_cn: 定义key和引用字段

source: Defining the Maximum Parallelism of Keyed State Operators
zh_cn: 为使用键值分区状态的算子定义最大并行度

source: Defining the user scope “MyMetrics”
zh_cn: 定义用户域"MyMetrics"

source: Deletes the JAR file referenced by the provided ID
zh_cn: 删除给定ID对应的JAR文件

source: Deleting a Savepoint
zh_cn: 删除保存点

source: Depend‐ ing on the application, you might care about average latency, maximum latency, or percentile latency.
zh_cn: 根据应用的不同，你可能会关注平均延迟，最大延迟或延迟的百分位数值。

source: Dependencies included in the classpath of Flink processes by default are automatically excluded from the JAR file.
zh_cn: 默认情况下，JAR包中会自动排除那些Flink进程的Classpath中所包含的依赖。

source: Depending on the environment (YARN, Mesos, Kubernetes, standalone cluster), some steps can be omitted or components might run in the same JVM process.
zh_cn: 根据环境的不同（YARN、Mesos、Kubernetes或独立集群），图中某些步骤其实可以省略，同时也可会有多个组件运行在同一JVM进程中。

source: Depending on how an application is submitted for execution (discussed in the next section), a dispatcher might not be required.
zh_cn: 根据应用提交执行的方式（会在下节讨论），dispatcher可能并非必需。

source: Depending on how an application is submitted for execution (dis‐ cussed in “Application Deployment”), a dispatcher might not be required.
zh_cn: 某些应用提交执行的方式（我们会在"应用部署"一节讨论）可能用不到Dispatcher。

source: Depending on how an operator is connected with its predecessor or successor operators, its tasks can receive records and water‐ marks from one or more input partitions and emit records and watermarks to one or more output partitions.
zh_cn: 根据算子的上下游连接情况，其任务可能需要同时接收来自多个输入分区的记录和水位线，也可能需要将它们发送到多个输出分区。

source: Depending on the application requirements, you might want to ignore such events, log them, or use them to correct previous results.
zh_cn: 根据应用需求的不同，你可能想直接忽略那些事件，将它们写入日志或利用它们去修正之前的结果。

source: Depending on the business logic, an event-driven application can trigger actions such as sending an alert or an email or write events to an outgoing event stream that is possibly consumed by another event-driven application.
zh_cn: 根据业务逻辑的不同，此类应用可能触发告警或发送电子邮件之类的操作，也支持将事件写入输出流以供其他同类应用消费使用。

source: Depending on the business logic, an event-driven application can trigger actions such as sending an alert or an email or write events to an outgoing event stream to be consumed by another event-driven application.
zh_cn: 根据业务逻辑的不同，此类应用可支持触发警报或发送电子邮件之类的操作，也可支持将事件写入输出流以供其他同类应用消费使用。

source: Depending on the business requirements, late data can later be integrated into the results of the streaming application with a periodic backfill process.
zh_cn: 根据业务需求，迟到数据可通过定期回填过程（backfill process）集成到流式应用的结果中。

source: Depending on the characteristics of an application, the size of its state, and the state backend and its configuration, a checkpoint can take up to a few minutes.
zh_cn: 取决于应用自身特征、状态大小、状态后端及其配置，生成一次检查点可能需要几分钟。

source: Depending on the concrete implementation of the sink opera‐ tor, the records can be written to any kind of storage or message system.
zh_cn: 根据数据汇算子的具体实现，这些记录可以被写入任意一个存储或消息系统中。

source: Depending on the encoding of a file, it can be necessary to only generate a single split
zh_cn: 根据文件的编码方式，有时候只能生成一个划分，将文件作为一个整体读入。

source: Depending on the failure that caused an application to crash, the application could be killed by the same failure again.
zh_cn: 根据导致应用崩溃的故障不同，应用有可能被相同的故障再次"杀死"。

source: Depending on the scheduling intervals it may take hours or days until a data point is included in a report.
zh_cn: 根据调度周期的不同，数据可能会在数小时或数天后才出现在报告中。

source: Depending on the sink operators of an application, some result records might be emitted multiple times to downstream sys‐ tems, such as an event log, a filesystem, or a database, during the recovery.
zh_cn: 根据应用所采用的数据汇算子，在恢复期间，某些结果记录可能会向下游系统（如事件日志系统、文件系统或数据库）发送多次。

source: Depending on the system from which the data is received, the data might be pushed or pulled.
zh_cn: 根据上游数据源系统的不同，数据可能以推送或拉取的形式获得。

source: Depending on the the environment (YARN, Mesos, Kubernetes, stand-alone cluster), some steps can be omitted or components might run in the same JVM process.
zh_cn: 根据环境的不同（YARN、Mesos、Kubernetes、独立集群），有些步骤其实可以省略，同时可能会有多个组件运行在同一个JVM进程中。

source: Depending on the type of execution environment, a JobManager is started as a local thread (local execution environment) or the JobGraph is sent to a remote JobManager.
zh_cn: 根据执行环境类型的不同，系统可能会将JobManager作为本地线程启动（本地执行环境），也可能会将JobGraph发送到远程JobManager上。

source: Depending on the use case and data store, the updates need to be processed before they can be incorporated.
zh_cn: 根据用例和数据存储系统的不同，需要在更新的数据整合前对它们进行一些处理。

source: Depending on the use case, it is possible to apply an initial filtering or transformation on the input stream before
zh_cn: 根据用例的不同，如果某些初始化的过滤或其他转换操作不会引起元素的重新分发，那么可以考虑在分配时间戳之前使用它们。

source: Depending on the use case, the transferred data may need to be normalized, enriched with external data, or aggregated before it is ingested by the target data store.
zh_cn: 根据用例的不同，转存的数据可能需要归一化，利用外部输入丰富数据或在写入目标存储之前进行数据聚合。

source: Depending on whether the other stream is keyed or not, a KeyedBroadcastProcessFunction or BroadcastPro cessFunction can be applied.
zh_cn: 根据另一条流是否已经按键值分区，该函数可能是KeyedBroadcastProcessFunction或BroadcastProcessFunction。

source: Deploying data processing frameworks and applications on Kubernetes has become very popular.
zh_cn: 基于Kubernetes部署数据处理框架及应用已经变得非常流行。

source: Deployment Modes
zh_cn: 部署模式

source: Deployment Modes | 223
zh_cn: 部署模式 | 223

source: Deployment Modes | 231
zh_cn: 部署模式 | 231

source: Deployments can be scaled up or down.
zh_cn: Deployment可以自由伸缩。

source: DeserializationSchema and KeyedDeserializationSchema are public interfaces so you can always implement custom deserialization logic.
zh_cn: DeserializationSchema和KeyedDeserializationSchema都是公开接口，因此你可以随意实现自定义的反序列化逻辑。

source: Designed for the special case where the state of each task of an operator is identi‐ cal.
zh_cn: 专门为那些需要保证算子的每个任务状态都相同的场景而设计。

source: Despite all these efforts, we recommend always dou‐ ble checking if an application can be evolved as planned before putting it into pro‐ duction.
zh_cn: 尽管如此，我们还是建议你在把应用投入到生产环境之前，仔细确认应用是否可以按计划更新。

source: Detailed and customizable collection of system and application metrics help to identify and react to problems ahead of time.
zh_cn: 详细、可自由定制的系统及应用指标集合有助于提前定位和响应问题。

source: Detailed and customizable collection of system and application metrics to iden‐ tify and react to problems ahead of time.
zh_cn: 提供了详细、可自由定制的系统及应用指标（metrics）集合，用于提前定位和响应问题。

source: Deterministic keys are important to ensure all writes are correctly overwritten in case of a recovery.
zh_cn: 确定性的键值对于恢复期间覆盖写入的正确性非常重要。

source: Disable task chaining for an operator
zh_cn: 禁用算子的任务链接

source: Disk Storage
zh_cn: 磁盘存储

source: Disposes of a savepoint
zh_cn: 删除保存点

source: Distributed data processing frameworks like Apache Flink need to be set up to interact with several components such as resource managers, filesystems, and services for distributed coordination.
zh_cn: 像Apache Flink这样的分布式数据处理框架需要通过设置与资源管理器、文件系统和分布式协调服务等多个组件进行交互。

source: Distribution Transformations
zh_cn: 分发转换

source: Distribution transformations reorganize stream events.
zh_cn: 对流中的事件进行重新组织的分发转换。

source: Do Not Use start-zookeeper-quorum.sh for Production Setups
zh_cn: 不要将start-zookeeper-quorum.sh用于生产环境

source: Do not evaluate per element
zh_cn: 不会针对每个元素都计算

source: Docker containers are run by the operating system kernel of the host system and are therefore more lightweight than virtual machines.
zh_cn: Docker容器由宿主机的操作系统内核负责运行，因此它比虚拟机更为轻量级。

source: Docker is a popular platform used to package and run applications in containers.
zh_cn: Docker是一个将应用打包并在容器中运行的流行平台。

source: Docker will download the requested image and its dependencies from Docker Hub and start the containers running Flink.
zh_cn: 利用上述命令，Docker将自动从Docker Hub下载所需的镜像及其依赖，并启动容器来运行Flink。

source: Does it include the time Alice was offline or not?
zh_cn: 需要把爱丽丝离线的时间考虑在内吗？

source: Download the JAR file that includes all example programs of this book.
zh_cn: 下载涵盖本书所有示例程序的JAR文件。

source: Download the JAR file that includes examples in this book:
zh_cn: 下载涵盖本书所有示例的JAR文件：

source: Dropping Late Events
zh_cn: 丢弃迟到事件

source: Dropping late events is the default behavior for event-time window operators.
zh_cn: 这也是事件时间窗口的默认行为。

source: Due to extensive support for user-defined functions, a wide variety of use cases can be covered by SQL.
zh_cn: 由于支持广泛的用户自定义函数，很多用例都可以直接用SQL来完成。

source: Due to its checkpointing mechanism, Flink can achieve very good performance.
zh_cn: 得益于该检查点机制，Flink的性能会非常高。

source: Due to its origin in the Hadoop ecosystem, YARN is typically used by data processing frameworks.
zh_cn: 由于源自Hadoop生态系统，YARN通常会用于数据处理框架中。

source: Due to the append-only characteristic of a socket, it is not possi‐
zh_cn: 由于套接字仅支持追加数据，所以无法实现幂等性写；

source: Due to the append-only property of the log, events are always published to all consumers in exactly the same order.
zh_cn: 得益于日志的追加特性，无论向消费者发布几次，事件的顺序都能保持一致。
